functions/test/test.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header/>
  <soap:Body>
    <v25:ProcessShipmentRequest xmlns:v25="http://fedex.com/ws/ship/v25">
      <v25:WebAuthenticationDetail>
        <v25:UserCredential>
          <v25:Key>4otzuKjLzVkx5qdQ</v25:Key>
          <v25:Password>AyaldeyfISXNQW9YZ7ctDk2jA</v25:Password>
        </v25:UserCredential>
      </v25:WebAuthenticationDetail>
      <v25:ClientDetail>
        <v25:AccountNumber>510087780</v25:AccountNumber>
        <v25:MeterNumber>119126102</v25:MeterNumber>
      </v25:ClientDetail>
      <v25:Version>
        <v25:ServiceId>cnty</v25:ServiceId>
        <v25:Major>8</v25:Major>
        <v25:Intermediate>0</v25:Intermediate>
        <v25:Minor>0</v25:Minor>
      </v25:Version>
      <v25:RequestedShipment>
        <v25:ShipTimestamp>2020-06-06T23:00:00.000Z</v25:ShipTimestamp>
        <v25:DropoffType>BUSINESS_SERVICE_CENTER</v25:DropoffType>
        <v25:ServiceType>FEDEX_EXPRESS_SAVER</v25:ServiceType>
        <v25:PackagingType>YOUR_PACKAGING</v25:PackagingType>
        <v25:PreferredCurrency>NMP</v25:PreferredCurrency>
        <v25:Shipper>
          <v25:Contact>
            <v25:PersonName>Juanita</v25:PersonName>
            <v25:PhoneNumber>9895956411</v25:PhoneNumber>
          </v25:Contact>
          <v25:Address>
            <v25:StreetLines>San Guillermo 1083</v25:StreetLines>
            <v25:City>GUADALAJARA</v25:City>
            <v25:StateOrProvinceCode>JA</v25:StateOrProvinceCode>
            <v25:PostalCode>44500</v25:PostalCode>
            <v25:CountryCode>MX</v25:CountryCode>
          </v25:Address>
        </v25:Shipper>
        <v25:Recipient>
          <v25:Contact>
            <v25:PersonName>Pepito</v25:PersonName>
            <v25:PhoneNumber>9895956411</v25:PhoneNumber>
          </v25:Contact>
          <v25:Address>
            <v25:StreetLines>Av. Mariano Otero 918</v25:StreetLines>
            <v25:City>GUADALAJARA</v25:City>
            <v25:StateOrProvinceCode>JA</v25:StateOrProvinceCode>
            <v25:PostalCode>44520</v25:PostalCode>
            <v25:CountryCode>MX</v25:CountryCode>
          </v25:Address>
        </v25:Recipient>
        <v25:ShippingChargesPayment>
          <v25:PaymentType>SENDER</v25:PaymentType>
          <v25:Payor>
            <v25:ResponsibleParty>
              <v25:AccountNumber>510087780</v25:AccountNumber>
              <v25:Contact>
                <v25:ContactId>12345</v25:ContactId>
                <v25:PersonName>Mimi</v25:PersonName>
              </v25:Contact>
            </v25:ResponsibleParty>
          </v25:Payor>
        </v25:ShippingChargesPayment>
        <v25:CustomsClearanceDetail>
          <v25:DutiesPayment>
            <v25:PaymentType>SENDER</v25:PaymentType>
            <v25:Payor>
              <v25:ResponsibleParty>
                <v25:AccountNumber>510087780</v25:AccountNumber>
                <v25:Contact>
                  <v25:ContactId>12345</v25:ContactId>
                  <v25:PersonName>Mimi</v25:PersonName>
                </v25:Contact>
              </v25:ResponsibleParty>
            </v25:Payor>
          </v25:DutiesPayment>
          <v25:DocumentContent>DOCUMENTS_ONLY</v25:DocumentContent>
          <v25:CustomsValue>
            <v25:Currency>USD</v25:Currency>
            <v25:Amount>100.00</v25:Amount>
          </v25:CustomsValue>
          <v25:CommercialInvoice>
            <v25:TermsOfSale>FOB_OR_FCA</v25:TermsOfSale>
          </v25:CommercialInvoice>
          <v25:Commodities>
            <v25:NumberOfPieces>1</v25:NumberOfPieces>
            <v25:Description>Laptops</v25:Description>
            <v25:CountryOfManufacture>MX</v25:CountryOfManufacture>
            <v25:Weight>
              <v25:Units>KG</v25:Units>
              <v25:Value>5</v25:Value>
            </v25:Weight>
            <v25:Quantity>1</v25:Quantity>
            <v25:QuantityUnits>cm</v25:QuantityUnits>
            <v25:UnitPrice>
              <v25:Currency>USD</v25:Currency>
              <v25:Amount>1.000000</v25:Amount>
            </v25:UnitPrice>
            <v25:CustomsValue>
              <v25:Currency>USD</v25:Currency>
              <v25:Amount>100.000000</v25:Amount>
            </v25:CustomsValue>
          </v25:Commodities>
          <v25:ExportDetail>
            <v25:ExportComplianceStatement>30.37(f)</v25:ExportComplianceStatement>
          </v25:ExportDetail>
        </v25:CustomsClearanceDetail>
        <v25:LabelSpecification>
          <v25:LabelFormatType>COMMON2D</v25:LabelFormatType>
          <v25:ImageType>PNG</v25:ImageType>
          <v25:LabelStockType>PAPER_7X4.75</v25:LabelStockType>
        </v25:LabelSpecification>
        <v25:RateRequestTypes>LIST</v25:RateRequestTypes>
        <v25:PackageCount>1</v25:PackageCount>
        <v25:RequestedPackageLineItems>
          <v25:SequenceNumber>1</v25:SequenceNumber>
          <v25:Weight>
            <v25:Units>KG</v25:Units>
            <v25:Value>5</v25:Value>
          </v25:Weight>
          <v25:Dimensions>
            <v25:Length>12</v25:Length>
            <v25:Width>12</v25:Width>
            <v25:Height>12</v25:Height>
            <v25:Units>CM</v25:Units>
          </v25:Dimensions>
        </v25:RequestedPackageLineItems>
      </v25:RequestedShipment>
    </v25:ProcessShipmentRequest>
  </soap:Body>
</soap:Envelope>
